app/controllers/messages_controller.rb

INSERT INTO "messages" ("topicId", "content", "owner", "created_at", "updated_at", "userId") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["topicId", 5], ["content", "jhsdfkj\r\n"], ["owner", "Anonymous"], ["created_at", "2020-08-12 21:33:35.861444"], ["updated_at", "2020-08-12 21:33:35.861444"], ["userId", 1]]
---
    def create
        parameters = params.require(:message).permit(:content, :topicId, :owner, :userId)
        message = Message.create(parameters)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 26]]
---
    def destroy
        message = Message.find(params[:id])
        message.destroy