app/controllers/pictures_controller.rb

    def create
        parameters = params.require(:picture).permit(:userId, :avatar)
        picture = Picture.create(parameters)
---
INSERT INTO "pictures" ("userId") VALUES ($1) RETURNING "id"  [["userId", 1]]

    def change
        parameters = params.require(:picture).permit(:userId, :avatar)
        picture = Picture.find_by(userId: parameters[:userId])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."userId" = $1 LIMIT $2  [["userId", 1], ["LIMIT", 1]]

    def update
        parameters = params.require(:picture).permit(:userId, :avatar)
        picture = Picture.find_by(userId: parameters[:userId])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."userId" = $1 LIMIT $2  [["userId", 1], ["LIMIT", 1]]