app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."topicId" = $1  [["topicId", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @topic = Topic.find(params[:id])
        @messages = Message.where(topicId: params[:id]).sort_by(&:created_at)
        @newMessage = Message.new
        @user = User.find(session[:user_id])

INSERT INTO "topics" ("title", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        parameters = params.require(:topic).permit(:title, :description)
        topic = Topic.create(parameters)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "topics" SET "title" = $1, "updated_at" = $2 WHERE "topics"."id" = $3  [["title", "Nex topic is the best modified topic"], ["updated_at", "2020-08-11 10:10:02.629058"], ["id", 2]]
---
    def update
        @topic = Topic.find(params[:id])
        parameters = params.require(:topic).permit(:title, :description)
        @topic.update(parameters)

DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 2]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 1]]
---
    def destroy
        Message.destroy_by(topicId: params[:id])
        @topic = Topic.find(params[:id])
        @topic.destroy