app/controllers/users_controller.rb

    def check
        parameters = params.require(:user).permit(:email, :password)
        if (parameters[:email].empty? || parameters[:password].empty?)
            session[:error] = "Missing email or password"
            redirect_to login_path
        else
            named = User.find_by({name: parameters[:email], password: parameters[:password]})
            emailed = User.find_by({email: parameters[:email], password: parameters[:password]})
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."password" = $2 LIMIT $3  [["name", "tom.lr@hotmail.fr"], ["password", "tata"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "tom.lr@hotmail.fr"], ["password", "tata"], ["LIMIT", 1]]

    def create
        parameters = params.require(:user).permit(:email, :password, :name)
        if (parameters[:email].empty? || parameters[:email].empty? || parameters[:email].empty?)
            session[:error] = "Invalid or missing email, password or name"
            redirect_to register_path
        else
            user = User.create(parameters)
---
INSERT INTO "users" ("email", "password", "name") VALUES ($1, $2, $3) RETURNING "id"  [["email", "tata@toto.com"], ["password", "toto"], ["name", "toto"]]

    def show
        @user = User.find(params[:id])
        @picture = Picture.find_or_initialize_by(userId: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."userId" = $1 LIMIT $2  [["userId", 1], ["LIMIT", 1]]

    def edit
        if (session[:user_id] == params[:id])
            redirect_to user_path(params[:id])
        end
        @user = User.find(params[:id])
        @picture = Picture.find_or_initialize_by(userId: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."userId" = $1 LIMIT $2  [["userId", 1], ["LIMIT", 1]]

    def update
        parameters = params.require(:user).permit(:description)
        user = User.find(session[:user_id])
        user.description = parameters[:description]
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "description" = $1 WHERE "users"."id" = $2